//Напишите программу, которая задаёт массив из 8 элементов и выводит их на экран.
//1, 2, 5, 7, 19, 6, 1, 33 -> [1, 2, 5, 7, 19, 6, 1, 33]
void FillnPrintArray(int[] array)
{
    Random rnd = new Random();
    for (int i = 0; i < array.Length; i++)
    {
        array[i] = rnd.Next(101);
    }
    string result = string.Join(" ", array);
    Console.Write(result);
}
int[] arr = new int[8];
FillnPrintArray(arr);

